Revit 2024 API
BuiltInFailures.ImportFailures.BadFaceFoundInDwg Property
 One or more hatch regions were found in the imported file with unconnected boundaries. These hatch regions will be ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadFaceFoundInDwg { get; }
Visual Basic
Public Shared ReadOnly Property BadFaceFoundInDwg As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadFaceFoundInDwg {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace